# ####################################################################

#  Created by Encounter(R) RTL Compiler v11.10-s016_1 on Tue Jun 05 18:17:46 +0530 2012

# ####################################################################

set sdc_version 1.7

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design row_dec

create_clock -name "CLOCK" -add -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 0.01 [get_clocks CLOCK]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {In[0]}]
set_input_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {In[1]}]
set_input_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {In[2]}]
set_input_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {In[3]}]
set_input_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {In[4]}]
set_input_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {In[5]}]
set_input_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {In[6]}]
set_input_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {In[7]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[255]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[254]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[253]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[252]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[251]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[250]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[249]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[248]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[247]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[246]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[245]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[244]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[243]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[242]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[241]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[240]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[239]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[238]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[237]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[236]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[235]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[234]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[233]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[232]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[231]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[230]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[229]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[228]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[227]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[226]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[225]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[224]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[223]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[222]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[221]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[220]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[219]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[218]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[217]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[216]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[215]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[214]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[213]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[212]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[211]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[210]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[209]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[208]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[207]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[206]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[205]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[204]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[203]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[202]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[201]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[200]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[199]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[198]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[197]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[196]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[195]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[194]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[193]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[192]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[191]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[190]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[189]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[188]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[187]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[186]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[185]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[184]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[183]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[182]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[181]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[180]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[179]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[178]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[177]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[176]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[175]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[174]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[173]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[172]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[171]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[170]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[169]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[168]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[167]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[166]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[165]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[164]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[163]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[162]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[161]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[160]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[159]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[158]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[157]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[156]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[155]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[154]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[153]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[152]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[151]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[150]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[149]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[148]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[147]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[146]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[145]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[144]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[143]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[142]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[141]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[140]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[139]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[138]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[137]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[136]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[135]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[134]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[133]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[132]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[131]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[130]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[129]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[128]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[127]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[126]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[125]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[124]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[123]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[122]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[121]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[120]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[119]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[118]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[117]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[116]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[115]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[114]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[113]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[112]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[111]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[110]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[109]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[108]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[107]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[106]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[105]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[104]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[103]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[102]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[101]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[100]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[99]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[98]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[97]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[96]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[95]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[94]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[93]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[92]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[91]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[90]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[89]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[88]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[87]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[86]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[85]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[84]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[83]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[82]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[81]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[80]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[79]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[78]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[77]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[76]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[75]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[74]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[73]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[72]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[71]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[70]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[69]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[68]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[67]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[66]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[65]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[64]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[63]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[62]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[61]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[60]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[59]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[58]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[57]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[56]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[55]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[54]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[53]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[52]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[51]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[50]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[49]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[48]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[47]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[46]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[45]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[44]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[43]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[42]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[41]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[40]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[39]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[38]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[37]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[36]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[35]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[34]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[33]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[32]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[31]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[30]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[29]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[28]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[27]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[26]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[25]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[24]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[23]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[22]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[21]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[20]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[19]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[18]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[17]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[16]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[15]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[14]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[13]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[12]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[11]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[10]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[9]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[8]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[7]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[6]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[5]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[4]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[3]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[2]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[1]}]
set_output_delay -clock [get_clocks CLOCK] -add_delay 0.01 [get_ports {wl[0]}]
set_max_capacitance 100.0 [get_ports {In[0]}]
set_max_capacitance 100.0 [get_ports {In[1]}]
set_max_capacitance 100.0 [get_ports {In[2]}]
set_max_capacitance 100.0 [get_ports {In[3]}]
set_max_capacitance 100.0 [get_ports {In[4]}]
set_max_capacitance 100.0 [get_ports {In[5]}]
set_max_capacitance 100.0 [get_ports {In[6]}]
set_max_capacitance 100.0 [get_ports {In[7]}]
set_max_capacitance 100.0 [get_ports clk]
set_max_capacitance 300.0 [get_ports {wl[255]}]
set_max_capacitance 300.0 [get_ports {wl[254]}]
set_max_capacitance 300.0 [get_ports {wl[253]}]
set_max_capacitance 300.0 [get_ports {wl[252]}]
set_max_capacitance 300.0 [get_ports {wl[251]}]
set_max_capacitance 300.0 [get_ports {wl[250]}]
set_max_capacitance 300.0 [get_ports {wl[249]}]
set_max_capacitance 300.0 [get_ports {wl[248]}]
set_max_capacitance 300.0 [get_ports {wl[247]}]
set_max_capacitance 300.0 [get_ports {wl[246]}]
set_max_capacitance 300.0 [get_ports {wl[245]}]
set_max_capacitance 300.0 [get_ports {wl[244]}]
set_max_capacitance 300.0 [get_ports {wl[243]}]
set_max_capacitance 300.0 [get_ports {wl[242]}]
set_max_capacitance 300.0 [get_ports {wl[241]}]
set_max_capacitance 300.0 [get_ports {wl[240]}]
set_max_capacitance 300.0 [get_ports {wl[239]}]
set_max_capacitance 300.0 [get_ports {wl[238]}]
set_max_capacitance 300.0 [get_ports {wl[237]}]
set_max_capacitance 300.0 [get_ports {wl[236]}]
set_max_capacitance 300.0 [get_ports {wl[235]}]
set_max_capacitance 300.0 [get_ports {wl[234]}]
set_max_capacitance 300.0 [get_ports {wl[233]}]
set_max_capacitance 300.0 [get_ports {wl[232]}]
set_max_capacitance 300.0 [get_ports {wl[231]}]
set_max_capacitance 300.0 [get_ports {wl[230]}]
set_max_capacitance 300.0 [get_ports {wl[229]}]
set_max_capacitance 300.0 [get_ports {wl[228]}]
set_max_capacitance 300.0 [get_ports {wl[227]}]
set_max_capacitance 300.0 [get_ports {wl[226]}]
set_max_capacitance 300.0 [get_ports {wl[225]}]
set_max_capacitance 300.0 [get_ports {wl[224]}]
set_max_capacitance 300.0 [get_ports {wl[223]}]
set_max_capacitance 300.0 [get_ports {wl[222]}]
set_max_capacitance 300.0 [get_ports {wl[221]}]
set_max_capacitance 300.0 [get_ports {wl[220]}]
set_max_capacitance 300.0 [get_ports {wl[219]}]
set_max_capacitance 300.0 [get_ports {wl[218]}]
set_max_capacitance 300.0 [get_ports {wl[217]}]
set_max_capacitance 300.0 [get_ports {wl[216]}]
set_max_capacitance 300.0 [get_ports {wl[215]}]
set_max_capacitance 300.0 [get_ports {wl[214]}]
set_max_capacitance 300.0 [get_ports {wl[213]}]
set_max_capacitance 300.0 [get_ports {wl[212]}]
set_max_capacitance 300.0 [get_ports {wl[211]}]
set_max_capacitance 300.0 [get_ports {wl[210]}]
set_max_capacitance 300.0 [get_ports {wl[209]}]
set_max_capacitance 300.0 [get_ports {wl[208]}]
set_max_capacitance 300.0 [get_ports {wl[207]}]
set_max_capacitance 300.0 [get_ports {wl[206]}]
set_max_capacitance 300.0 [get_ports {wl[205]}]
set_max_capacitance 300.0 [get_ports {wl[204]}]
set_max_capacitance 300.0 [get_ports {wl[203]}]
set_max_capacitance 300.0 [get_ports {wl[202]}]
set_max_capacitance 300.0 [get_ports {wl[201]}]
set_max_capacitance 300.0 [get_ports {wl[200]}]
set_max_capacitance 300.0 [get_ports {wl[199]}]
set_max_capacitance 300.0 [get_ports {wl[198]}]
set_max_capacitance 300.0 [get_ports {wl[197]}]
set_max_capacitance 300.0 [get_ports {wl[196]}]
set_max_capacitance 300.0 [get_ports {wl[195]}]
set_max_capacitance 300.0 [get_ports {wl[194]}]
set_max_capacitance 300.0 [get_ports {wl[193]}]
set_max_capacitance 300.0 [get_ports {wl[192]}]
set_max_capacitance 300.0 [get_ports {wl[191]}]
set_max_capacitance 300.0 [get_ports {wl[190]}]
set_max_capacitance 300.0 [get_ports {wl[189]}]
set_max_capacitance 300.0 [get_ports {wl[188]}]
set_max_capacitance 300.0 [get_ports {wl[187]}]
set_max_capacitance 300.0 [get_ports {wl[186]}]
set_max_capacitance 300.0 [get_ports {wl[185]}]
set_max_capacitance 300.0 [get_ports {wl[184]}]
set_max_capacitance 300.0 [get_ports {wl[183]}]
set_max_capacitance 300.0 [get_ports {wl[182]}]
set_max_capacitance 300.0 [get_ports {wl[181]}]
set_max_capacitance 300.0 [get_ports {wl[180]}]
set_max_capacitance 300.0 [get_ports {wl[179]}]
set_max_capacitance 300.0 [get_ports {wl[178]}]
set_max_capacitance 300.0 [get_ports {wl[177]}]
set_max_capacitance 300.0 [get_ports {wl[176]}]
set_max_capacitance 300.0 [get_ports {wl[175]}]
set_max_capacitance 300.0 [get_ports {wl[174]}]
set_max_capacitance 300.0 [get_ports {wl[173]}]
set_max_capacitance 300.0 [get_ports {wl[172]}]
set_max_capacitance 300.0 [get_ports {wl[171]}]
set_max_capacitance 300.0 [get_ports {wl[170]}]
set_max_capacitance 300.0 [get_ports {wl[169]}]
set_max_capacitance 300.0 [get_ports {wl[168]}]
set_max_capacitance 300.0 [get_ports {wl[167]}]
set_max_capacitance 300.0 [get_ports {wl[166]}]
set_max_capacitance 300.0 [get_ports {wl[165]}]
set_max_capacitance 300.0 [get_ports {wl[164]}]
set_max_capacitance 300.0 [get_ports {wl[163]}]
set_max_capacitance 300.0 [get_ports {wl[162]}]
set_max_capacitance 300.0 [get_ports {wl[161]}]
set_max_capacitance 300.0 [get_ports {wl[160]}]
set_max_capacitance 300.0 [get_ports {wl[159]}]
set_max_capacitance 300.0 [get_ports {wl[158]}]
set_max_capacitance 300.0 [get_ports {wl[157]}]
set_max_capacitance 300.0 [get_ports {wl[156]}]
set_max_capacitance 300.0 [get_ports {wl[155]}]
set_max_capacitance 300.0 [get_ports {wl[154]}]
set_max_capacitance 300.0 [get_ports {wl[153]}]
set_max_capacitance 300.0 [get_ports {wl[152]}]
set_max_capacitance 300.0 [get_ports {wl[151]}]
set_max_capacitance 300.0 [get_ports {wl[150]}]
set_max_capacitance 300.0 [get_ports {wl[149]}]
set_max_capacitance 300.0 [get_ports {wl[148]}]
set_max_capacitance 300.0 [get_ports {wl[147]}]
set_max_capacitance 300.0 [get_ports {wl[146]}]
set_max_capacitance 300.0 [get_ports {wl[145]}]
set_max_capacitance 300.0 [get_ports {wl[144]}]
set_max_capacitance 300.0 [get_ports {wl[143]}]
set_max_capacitance 300.0 [get_ports {wl[142]}]
set_max_capacitance 300.0 [get_ports {wl[141]}]
set_max_capacitance 300.0 [get_ports {wl[140]}]
set_max_capacitance 300.0 [get_ports {wl[139]}]
set_max_capacitance 300.0 [get_ports {wl[138]}]
set_max_capacitance 300.0 [get_ports {wl[137]}]
set_max_capacitance 300.0 [get_ports {wl[136]}]
set_max_capacitance 300.0 [get_ports {wl[135]}]
set_max_capacitance 300.0 [get_ports {wl[134]}]
set_max_capacitance 300.0 [get_ports {wl[133]}]
set_max_capacitance 300.0 [get_ports {wl[132]}]
set_max_capacitance 300.0 [get_ports {wl[131]}]
set_max_capacitance 300.0 [get_ports {wl[130]}]
set_max_capacitance 300.0 [get_ports {wl[129]}]
set_max_capacitance 300.0 [get_ports {wl[128]}]
set_max_capacitance 300.0 [get_ports {wl[127]}]
set_max_capacitance 300.0 [get_ports {wl[126]}]
set_max_capacitance 300.0 [get_ports {wl[125]}]
set_max_capacitance 300.0 [get_ports {wl[124]}]
set_max_capacitance 300.0 [get_ports {wl[123]}]
set_max_capacitance 300.0 [get_ports {wl[122]}]
set_max_capacitance 300.0 [get_ports {wl[121]}]
set_max_capacitance 300.0 [get_ports {wl[120]}]
set_max_capacitance 300.0 [get_ports {wl[119]}]
set_max_capacitance 300.0 [get_ports {wl[118]}]
set_max_capacitance 300.0 [get_ports {wl[117]}]
set_max_capacitance 300.0 [get_ports {wl[116]}]
set_max_capacitance 300.0 [get_ports {wl[115]}]
set_max_capacitance 300.0 [get_ports {wl[114]}]
set_max_capacitance 300.0 [get_ports {wl[113]}]
set_max_capacitance 300.0 [get_ports {wl[112]}]
set_max_capacitance 300.0 [get_ports {wl[111]}]
set_max_capacitance 300.0 [get_ports {wl[110]}]
set_max_capacitance 300.0 [get_ports {wl[109]}]
set_max_capacitance 300.0 [get_ports {wl[108]}]
set_max_capacitance 300.0 [get_ports {wl[107]}]
set_max_capacitance 300.0 [get_ports {wl[106]}]
set_max_capacitance 300.0 [get_ports {wl[105]}]
set_max_capacitance 300.0 [get_ports {wl[104]}]
set_max_capacitance 300.0 [get_ports {wl[103]}]
set_max_capacitance 300.0 [get_ports {wl[102]}]
set_max_capacitance 300.0 [get_ports {wl[101]}]
set_max_capacitance 300.0 [get_ports {wl[100]}]
set_max_capacitance 300.0 [get_ports {wl[99]}]
set_max_capacitance 300.0 [get_ports {wl[98]}]
set_max_capacitance 300.0 [get_ports {wl[97]}]
set_max_capacitance 300.0 [get_ports {wl[96]}]
set_max_capacitance 300.0 [get_ports {wl[95]}]
set_max_capacitance 300.0 [get_ports {wl[94]}]
set_max_capacitance 300.0 [get_ports {wl[93]}]
set_max_capacitance 300.0 [get_ports {wl[92]}]
set_max_capacitance 300.0 [get_ports {wl[91]}]
set_max_capacitance 300.0 [get_ports {wl[90]}]
set_max_capacitance 300.0 [get_ports {wl[89]}]
set_max_capacitance 300.0 [get_ports {wl[88]}]
set_max_capacitance 300.0 [get_ports {wl[87]}]
set_max_capacitance 300.0 [get_ports {wl[86]}]
set_max_capacitance 300.0 [get_ports {wl[85]}]
set_max_capacitance 300.0 [get_ports {wl[84]}]
set_max_capacitance 300.0 [get_ports {wl[83]}]
set_max_capacitance 300.0 [get_ports {wl[82]}]
set_max_capacitance 300.0 [get_ports {wl[81]}]
set_max_capacitance 300.0 [get_ports {wl[80]}]
set_max_capacitance 300.0 [get_ports {wl[79]}]
set_max_capacitance 300.0 [get_ports {wl[78]}]
set_max_capacitance 300.0 [get_ports {wl[77]}]
set_max_capacitance 300.0 [get_ports {wl[76]}]
set_max_capacitance 300.0 [get_ports {wl[75]}]
set_max_capacitance 300.0 [get_ports {wl[74]}]
set_max_capacitance 300.0 [get_ports {wl[73]}]
set_max_capacitance 300.0 [get_ports {wl[72]}]
set_max_capacitance 300.0 [get_ports {wl[71]}]
set_max_capacitance 300.0 [get_ports {wl[70]}]
set_max_capacitance 300.0 [get_ports {wl[69]}]
set_max_capacitance 300.0 [get_ports {wl[68]}]
set_max_capacitance 300.0 [get_ports {wl[67]}]
set_max_capacitance 300.0 [get_ports {wl[66]}]
set_max_capacitance 300.0 [get_ports {wl[65]}]
set_max_capacitance 300.0 [get_ports {wl[64]}]
set_max_capacitance 300.0 [get_ports {wl[63]}]
set_max_capacitance 300.0 [get_ports {wl[62]}]
set_max_capacitance 300.0 [get_ports {wl[61]}]
set_max_capacitance 300.0 [get_ports {wl[60]}]
set_max_capacitance 300.0 [get_ports {wl[59]}]
set_max_capacitance 300.0 [get_ports {wl[58]}]
set_max_capacitance 300.0 [get_ports {wl[57]}]
set_max_capacitance 300.0 [get_ports {wl[56]}]
set_max_capacitance 300.0 [get_ports {wl[55]}]
set_max_capacitance 300.0 [get_ports {wl[54]}]
set_max_capacitance 300.0 [get_ports {wl[53]}]
set_max_capacitance 300.0 [get_ports {wl[52]}]
set_max_capacitance 300.0 [get_ports {wl[51]}]
set_max_capacitance 300.0 [get_ports {wl[50]}]
set_max_capacitance 300.0 [get_ports {wl[49]}]
set_max_capacitance 300.0 [get_ports {wl[48]}]
set_max_capacitance 300.0 [get_ports {wl[47]}]
set_max_capacitance 300.0 [get_ports {wl[46]}]
set_max_capacitance 300.0 [get_ports {wl[45]}]
set_max_capacitance 300.0 [get_ports {wl[44]}]
set_max_capacitance 300.0 [get_ports {wl[43]}]
set_max_capacitance 300.0 [get_ports {wl[42]}]
set_max_capacitance 300.0 [get_ports {wl[41]}]
set_max_capacitance 300.0 [get_ports {wl[40]}]
set_max_capacitance 300.0 [get_ports {wl[39]}]
set_max_capacitance 300.0 [get_ports {wl[38]}]
set_max_capacitance 300.0 [get_ports {wl[37]}]
set_max_capacitance 300.0 [get_ports {wl[36]}]
set_max_capacitance 300.0 [get_ports {wl[35]}]
set_max_capacitance 300.0 [get_ports {wl[34]}]
set_max_capacitance 300.0 [get_ports {wl[33]}]
set_max_capacitance 300.0 [get_ports {wl[32]}]
set_max_capacitance 300.0 [get_ports {wl[31]}]
set_max_capacitance 300.0 [get_ports {wl[30]}]
set_max_capacitance 300.0 [get_ports {wl[29]}]
set_max_capacitance 300.0 [get_ports {wl[28]}]
set_max_capacitance 300.0 [get_ports {wl[27]}]
set_max_capacitance 300.0 [get_ports {wl[26]}]
set_max_capacitance 300.0 [get_ports {wl[25]}]
set_max_capacitance 300.0 [get_ports {wl[24]}]
set_max_capacitance 300.0 [get_ports {wl[23]}]
set_max_capacitance 300.0 [get_ports {wl[22]}]
set_max_capacitance 300.0 [get_ports {wl[21]}]
set_max_capacitance 300.0 [get_ports {wl[20]}]
set_max_capacitance 300.0 [get_ports {wl[19]}]
set_max_capacitance 300.0 [get_ports {wl[18]}]
set_max_capacitance 300.0 [get_ports {wl[17]}]
set_max_capacitance 300.0 [get_ports {wl[16]}]
set_max_capacitance 300.0 [get_ports {wl[15]}]
set_max_capacitance 300.0 [get_ports {wl[14]}]
set_max_capacitance 300.0 [get_ports {wl[13]}]
set_max_capacitance 300.0 [get_ports {wl[12]}]
set_max_capacitance 300.0 [get_ports {wl[11]}]
set_max_capacitance 300.0 [get_ports {wl[10]}]
set_max_capacitance 300.0 [get_ports {wl[9]}]
set_max_capacitance 300.0 [get_ports {wl[8]}]
set_max_capacitance 300.0 [get_ports {wl[7]}]
set_max_capacitance 300.0 [get_ports {wl[6]}]
set_max_capacitance 300.0 [get_ports {wl[5]}]
set_max_capacitance 300.0 [get_ports {wl[4]}]
set_max_capacitance 300.0 [get_ports {wl[3]}]
set_max_capacitance 300.0 [get_ports {wl[2]}]
set_max_capacitance 300.0 [get_ports {wl[1]}]
set_max_capacitance 300.0 [get_ports {wl[0]}]
set_wire_load_mode "enclosed"
